import 'dart:ui';

import 'package:flutter/material.dart';

List<String> Holiday_Config = [
  '2025-01-01',  // 元旦
  '2025-01-28',  // 春节
  '2025-01-29',  // 春节
  '2025-01-30',  // 春节
  '2025-01-31',  // 春节
  '2025-02-01',  // 春节
  '2025-02-02',  // 春节
  '2025-02-03',  // 春节
  '2025-02-04',  // 春节
  '2025-04-04',  // 清明节
  '2025-04-05',  // 清明节
  '2025-04-06',  // 清明节
  '2025-05-01',  // 劳动节
  '2025-05-02',  // 劳动节
  '2025-05-03',  // 劳动节
  '2025-05-04',  // 劳动节
  '2025-05-05',  // 劳动节
  '2025-05-31',  // 端午节
  '2025-06-01',  // 端午节
  '2025-06-02',  // 端午节
  '2025-09-01',  // 中秋节
  '2025-10-01',  // 国庆节
  '2025-10-02',  // 国庆节
  '2025-10-03',  // 国庆节
  '2025-10-04',  // 国庆节
  '2025-10-05',  // 国庆节
  '2025-10-06',  // 国庆节
  '2025-10-07',  // 国庆节
  '2025-10-08',  // 国庆节
];

//因调休需要上班日期
List<String> Other_Work_Day_Config = [
  '2025-01-26',  // 春节调班
  '2025-02-08',  // 春节调班
  '2025-04-27',  // 五一调班
  '2025-09-28',  // 十一调班
  '2025-10-11',  // 十一调班
];

//打卡提示类型
enum Sign_Type{
  Wait_Sign,
  Had_Sign,
  Lose_Sign
}

Color Wait_Sign_Color = Colors.orange;
Color Had_Sign_Color = Colors.green;
Color Lose_Sign_Color = Colors.red;